assistpro-backend/codes/app/Repositories/DonationRepository.php

SELECT *
FROM `donations`
WHERE `donations`.`id` = 1
---
    public function find(int $id): ?Donation
    {
        $donation = $this->donation->find($id);

SELECT *
FROM `donations`
WHERE `student_id` = 452
---
    public function getAllByStudentId(int $studentId): array
    {
        return $this->donation->where('student_id', $studentId)->findAll();