assistpro-backend/codes/app/Repositories/ReportRepository.php

    public function getDonationReport(array $filters = []): array
    {
        $fromDate = $filters['from_date'] ?? null;
        $toDate = $filters['to_date'] ?? null;
        $status = $filters['status'] ?? null;
        $branchId = $filters['branch_id'] ?? null;
        $type = $filters['type'] ?? null;

        // Base student query
        $studentBuilder = $this->db->table($this->studentTable)->select('*');

        // Apply status filter
        if ($status !== null) {
            $studentBuilder->where('status', $status);
        }

        // Apply branch filter
        if ($branchId !== null) {
            $studentBuilder->where('branch_id', $branchId);
        }

        $students = $studentBuilder->get()->getResult();
---
SELECT *
FROM `students`

        $studentIds = array_column($students, 'id');

        // Donation query with date range
        $donationBuilder = $this->db->table($this->donationTable)
            ->select('donations.*')
            ->where('date >=', $fromDate)
            ->where('date <=', $toDate)
            ->whereIn('student_id', $studentIds);
---
SELECT *
FROM `donations`
WHERE `date` >= '2025-05-01'
AND `date` <= '2025-05-21'
AND `student_id` IN ('314','315','320','321','322','328','452','454','455','456','459','460','461','462','463','464','465','466','467','469','470','471','472','473','474','476','477','478','479','480','481')