assistpro-backend/codes/app/Repositories/StudentRepository.php

SELECT *
FROM `students`
WHERE   (
`name` LIKE '%aklima%' ESCAPE '!'
OR  `code` LIKE '%aklima%' ESCAPE '!'
 )
ORDER BY `id` DESC
 LIMIT 25
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE   (
`name` LIKE '%aklima%' ESCAPE '!'
OR  `code` LIKE '%aklima%' ESCAPE '!'
 )
---
    public function getAllPaginated(array $filters): array
    {
        // Number of records per page
        $perPage = array_key_exists('per_page', $filters)
            ? (int) $filters['per_page']
            : 25;

        $builder = $this->student
            ->orderBy('id', 'DESC');

        if (!empty($filters['branch_id']) && $filters['branch_id'] != -1) {
            $builder->where('branch_id', $filters['branch_id']);
        }

        // Apply search filter if provided
        if (!empty($filters['search'])) {
            $search = $filters['search'];
            $builder->groupStart() // To encapsulate the OR conditions
            ->like('name', $search)
                ->orLike('code', $search)
                ->groupEnd();
        }

        // Apply status filter if provided
        if (!empty($filters['status'])) {
            $builder->where('status', $filters['status']);
        }

        // Paginate with the specified per-page count and retrieve paginated data
        $students = $builder
            ->paginate($perPage);

SELECT CONCAT(students.name, ' [', `students`.`code`, ']') AS label, `students`.`id` AS `key`
FROM `students`
ORDER BY `students`.`name`
---
    public function getAll(array $filters = []): array
    {
        $builder = $this->student
            ->select("CONCAT(students.name, ' [', students.code, ']') AS label, students.id AS key")
            ->orderBy('students.name');

        // Apply search filter if provided
        if (!empty($filters['search'])) {
            $search = $filters['search'];
            $builder->groupStart() // To encapsulate the OR conditions
            ->like('name', $search)
                ->orLike('code', $search)
                ->groupEnd();
        }

        // Apply limit filter if provided
        if (!empty($filters['limit'])) {
            $builder->limit((int) $filters['limit']);
        }

        return $builder->get()->getResultArray(); // Use getResultArray for consistent output

SELECT *
FROM `students`
WHERE `id` IN ('315','452','314')
---
    public function getByIds(array $ids):array
    {
        return $this->student->whereIn('id', $ids)->findAll();

SELECT *
FROM `students`
WHERE `students`.`id` = 315
---
    public function find(int $id): ?Student
    {
        return $this->student->find($id);

INSERT INTO `students` (`code`, `name`, `father_name`, `mother_name`, `gender`, `address_present`, `address_permanent`, `nid`, `institution`, `year`, `branch_id`, `status`, `created_at`, `updated_at`) VALUES (1, 'aaaaa', 'aaaa', 'aaaaa', 'Male', '', '', NULL, 'aaaaa', '', 1, 'Active', '2025-04-15 07:59:48', '2025-04-15 07:59:48')
---
    public function save(Entity $student): int
    {
        return $this->student->insert($student);